testsrc/main/mondrian/xmla/excel_XP/excel_XP_18_in.xml

<?xml version="1.0"?>
<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
  <Header>
    <XA:Session SessionId="${session.id}" mustUnderstand="1" xmlns:XA="urn:schemas-microsoft-com:xml-analysis"/>
  </Header>
  <Body>
    <Execute xmlns="urn:schemas-microsoft-com:xml-analysis">
      <Command>
        <Statement>SELECT NON EMPTY HIERARCHIZE({[Time].[Year].members})
DIMENSION PROPERTIES PARENT_UNIQUE_NAME ON COLUMNS  FROM [Sales]</Statement>
      </Command>
      <Properties>
        <PropertyList>
          <LocaleIdentifier>1033</LocaleIdentifier>
          <DataSourceInfo>MondrianFoodMart</DataSourceInfo>
          <Catalog>FoodMart</Catalog>
          <Format>Multidimensional</Format>
          <AxisFormat>TupleFormat</AxisFormat>
          <Content>SchemaData</Content>
        </PropertyList>
      </Properties>
    </Execute>
  </Body>
</Envelope>
